ParagPat20/Codes/RollopodCodes/esp32_slave_pca9685/esp32_slave_pca9685.ino
/*
 * ESP32 Slave PCA9685 16-Channel Servo Controller (ESP-NOW Version)
 *
 * Controls up to 16 servos via PCA9685 PWM driver board using direct PWM tick
 * values Receives commands via ESP-NOW from master ESP32 (connected to PC)
 *
 * Setup Instructions:
 * 1. Upload this sketch to ESP32 Slave (on robot)
 * 2. Open Serial Monitor and note the MAC address displayed
 * 3. Copy this MAC address to the master ESP32 sketch
 * 4. This ESP32 will now receive commands wirelessly from the master
 *
 * Requirements:
 * - ESP32 Arduino Core 2.0.0 or higher (3.0.0+ recommended)
 * - Adafruit PWM Servo Driver Library (for PCA9685)
 * - Wire library (I2C, included in Arduino)
 *
 * Based on ESP-NOW best practices from:
 * https://randomnerdtutorials.com/esp-now-esp32-arduino-ide/
 *
 * Serial Commands (received via ESP-NOW):
 * - "TICK <channel> <value>"     : Set PWM tick value (0-4095) on channel
 * (0-15)
 * - "ANGLE <channel> <angle>"    : Set servo angle (0.0-180.0) using calibrated
 * tick values
 * - "CAL <channel> <min> <max>"  : Set tick calibration for channel (min/max
 * ticks for 0/180 degrees)
 * - "CAL_ALL <min> <max>"        : Set tick calibration for all channels
 * - "GET_CAL <channel>"          : Get calibration values for a channel
 * - "GET_ALL_CAL"                : Get all calibration values
 * - "FREQ <frequency>"            : Set PWM frequency in Hz (40-1000, typical
 * 50)
 * - "SLEEP"                       : Put PCA9685 in sleep mode
 * - "WAKE"                        : Wake PCA9685 from sleep mode
 * - "RESET"                       : Reset PCA9685 to default settings
 * - "INFO"                        : Print current configuration
 *
 * Wiring:
 * PCA9685 SDA -> ESP32 GPIO21 (default I2C SDA)
 * PCA9685 SCL -> ESP32 GPIO22 (default I2C SCL)
 * PCA9685 VCC -> 5V
 * PCA9685 GND -> GND
 * PCA9685 V+  -> External 5-6V power supply for servos
 */

#include <Adafruit_PWMServoDriver.h>
#include <MPU6050_tockn.h>
#include <WiFi.h>
#include <Wire.h>
#include <esp_idf_version.h>
#include <esp_now.h>
#include <esp_wifi.h>


// PCA9685 I2C address (default is 0x40)
#define PCA9685_ADDRESS 0x40

// Default PWM tick values (12-bit resolution: 0-4095)
#define TICK_MIN_DEFAULT 102 // ~500us at 50Hz (102 ticks)
#define TICK_MAX_DEFAULT 512 // ~2500us at 50Hz (512 ticks)

// Default PWM frequency for servos (Hz)
#define SERVO_FREQ_DEFAULT 50

// Create PCA9685 driver object
Adafruit_PWMServoDriver pca = Adafruit_PWMServoDriver(PCA9685_ADDRESS);

// ============================================================
// PIN ASSIGNMENTS (Seeed Studio XIAO ESP32-C6 / EasyEDA Schematic)
// ============================================================
// MOSFET Power Control Pin (IRL84132PBF Gate control - EasyEDA Pin 1 / GPIO0)
#define MOSFET_PIN 18

// DC Motor Control Pins (MD13S Driver - EasyEDA Pin 8 / GPIO17 & Pin 9 / GPIO19)
#define MOTOR_PWM_PIN 19
#define MOTOR_DIR_PIN 17

// I2C Bus Pins (EasyEDA Pin 4 / GPIO21 SDA & Pin 5 / GPIO22 SCL)
#define I2C_SDA_PIN 21
#define I2C_SCL_PIN 22

// Internal RF Antenna Setup for Seeed Studio XIAO ESP32-C6
void setupAntenna() {
#if defined(CONFIG_IDF_TARGET_ESP32C6) ||                                      \
    defined(ARDUINO_SEEED_XIAO_ESP32C6) || defined(ESP32C6)
  pinMode(3, OUTPUT);
  digitalWrite(3, LOW); // Turn on antenna selection circuit
  delay(100);
  pinMode(14, OUTPUT);
  digitalWrite(14, LOW); // LOW = Built-in Internal PCB Antenna
  Serial.println("[ANTENNA] XIAO ESP32-C6: Internal PCB Antenna Configured "
                 "(GPIO3=LOW, GPIO14=LOW)");
#else
  Serial.println("[ANTENNA] Standard ESP32 DevKit Board");
#endif
}

#ifndef LED_BUILTIN
#define LED_BUILTIN 15
#endif

// Non-blocking LED timing & mode control for Slave
unsigned long lastSlaveLedToggle = 0;
bool slaveLedState = false;
int slaveBurstToggles = 0;
unsigned long lastMasterCommandTime = 0;
const unsigned long MASTER_AVAILABLE_TIMEOUT_MS = 2500;

void updateSlaveLed() {
  unsigned long now = millis();

  // Fast Blinks burst when explicit command is received (6 toggles @ 35ms)
  if (slaveBurstToggles > 0) {
    if (now - lastSlaveLedToggle >= 35) {
      lastSlaveLedToggle = now;
      slaveLedState = !slaveLedState;
      digitalWrite(LED_BUILTIN, slaveLedState ? HIGH : LOW);
      slaveBurstToggles--;
    }
    return;
  }

  // Check if Master is available (heartbeat/command received within last 2.5
  // sec)
  bool isMasterAvailable =
      (now - lastMasterCommandTime < MASTER_AVAILABLE_TIMEOUT_MS);

  if (!isMasterAvailable) {
    // SOLID OFF when Master is disconnected / unavailable
    digitalWrite(LED_BUILTIN, LOW);
  } else {
    // SLOW BLINK (500ms ON / 500ms OFF) when Master is connected
    if (now - lastSlaveLedToggle >= 500) {
      lastSlaveLedToggle = now;
      slaveLedState = !slaveLedState;
      digitalWrite(LED_BUILTIN, slaveLedState ? HIGH : LOW);
    }
  }
}

// MPU6050 Configuration & Variables
#define MPU6050_ADDRESS 0x68
MPU6050 mpu(Wire);
bool mpuInitialized = false;
float accelAngle = 0.0;
float gyroAngle = 0.0;
float filteredAngle = 0.0;
unsigned long lastMpuUpdate = 0;

// Telemetry & ESP-NOW target
uint8_t masterMac[6];
bool hasMasterMac = false;
bool telemetryEnabled = false;
unsigned long lastTelemetryTime = 0;
const unsigned long TELEMETRY_INTERVAL = 100; // 100 ms interval (10 Hz)

// ============================================================
// Data Structures for ESP-NOW (Match exactly with master)
// ============================================================

// Master -> Slave Command Structure
typedef struct cmd_struct {
  char command[16];
  int val1;
  int val2;
  float val3;
} cmd_struct;

// Slave -> Master Telemetry/Response Structure
typedef struct telemetry_struct {
  char type[10];
  char message[128];
  float pitch;
} telemetry_struct;

cmd_struct myCmd;
telemetry_struct myData;

// Servo configuration structure using tick values
struct ServoConfig {
  uint16_t tickMin;     // Minimum PWM tick value (0 degrees)
  uint16_t tickMax;     // Maximum PWM tick value (180 degrees)
  uint16_t currentTick; // Current PWM tick value
  float lastAngle;      // Last set angle (0.0-180.0)
};

// Configuration for all 16 channels
ServoConfig servoConfigs[16];
uint16_t pwmFrequency = SERVO_FREQ_DEFAULT;

// ESP-NOW command buffer
String commandBuffer = "";

// Function prototypes
void initESPNow();
void onDataRecv(const esp_now_recv_info *recvInfo, const uint8_t *data,
                int len);
void sendResponse(const char *response, const uint8_t *mac_addr);
void printMacAddress();

void setServoPWM(uint8_t channel, uint16_t tickValue);
void setServoAngle(uint8_t channel, float angle);
void setPWMFrequency(uint16_t freq);
void setCalibration(uint8_t channel, uint16_t minTick, uint16_t maxTick);
void setAllCalibrations(uint16_t minTick, uint16_t maxTick);
void getCalibration(uint8_t channel, const uint8_t *senderMac);
void getAllCalibrations(const uint8_t *senderMac);
void resetToDefaults();
void printInfo(const uint8_t *senderMac);
void processCommand(String command, const uint8_t *senderMac);

