ParagPat20/Codes/RollopodCodes/esp32_slave_pca9685/esp32_slave_pca9685.ino
// New Helper Functions
bool initMPU6050();
void updateMPU();
void setMotorSpeed(int speed);
void setTorque(int state);
void sendTelemetry();

void setup() {
  // Initialize LED_BUILTIN pin
  pinMode(LED_BUILTIN, OUTPUT);

  // Initialize Internal RF Antenna for XIAO ESP32-C6
  setupAntenna();

  // Configure and turn on MOSFET power control pin
  pinMode(MOSFET_PIN, OUTPUT);
  digitalWrite(MOSFET_PIN, LOW); // Start at No torque (fully off)
  delay(100);                    // Wait for power to stabilize

  // Configure DC Motor pins
  pinMode(MOTOR_DIR_PIN, OUTPUT);
  pinMode(MOTOR_PWM_PIN, OUTPUT);
  digitalWrite(MOTOR_DIR_PIN, LOW);
  analogWrite(MOTOR_PWM_PIN, 0); // Start with motor stopped

  // Initialize serial communication for debugging
  Serial.begin(115200);
#if defined(ARDUINO_USB_CDC_ON_BOOT) && (ARDUINO_USB_CDC_ON_BOOT == 1)
  Serial.setTxTimeoutMs(
      0); // 0ms timeout: Prevent Serial.print blocking on USB-CDC hardware
#endif
  delay(500);

  Serial.println("\n\n========================================");
  Serial.println("ESP32-C6 Slave PCA9685 Controller - ESP-NOW");
  Serial.println("========================================");

  // Initialize ESP-NOW (Enables WiFi Station mode)
  initESPNow();

  // Print MAC address (needed for master configuration)
  Serial.print("\n*** SLAVE MAC ADDRESS: ");
  printMacAddress();
  Serial.println("*** Copy this MAC to master ESP32 sketch ***\n");

  // Initialize I2C with schematic pins (SDA=21, SCL=22)
  Wire.begin(I2C_SDA_PIN, I2C_SCL_PIN);

  // Initialize MPU6050
  Serial.println("Initializing MPU6050...");
  mpuInitialized = initMPU6050();
  if (mpuInitialized) {
    Serial.println("MPU6050 initialized successfully");
    lastMpuUpdate = millis();
  } else {
    Serial.println("ERROR: MPU6050 not found on I2C bus!");
  }

  // Initialize PCA9685
  Serial.println("Initializing PCA9685...");
  pca.begin();

  // Set initial PWM frequency
  pca.setPWMFreq(SERVO_FREQ_DEFAULT);

  // Initialize all servo configurations to defaults
  for (int i = 0; i < 16; i++) {
    servoConfigs[i].tickMin = TICK_MIN_DEFAULT;
    servoConfigs[i].tickMax = TICK_MAX_DEFAULT;
    servoConfigs[i].currentTick = (TICK_MIN_DEFAULT + TICK_MAX_DEFAULT) / 2;
    servoConfigs[i].lastAngle = 90.0;
    // Set all channels to center position (90 degrees)
    setServoAngle(i, 90.0);
  }

  Serial.println("PCA9685 initialized successfully");
  Serial.println("Default frequency: 50 Hz");
  Serial.println("Default tick range: 102-512 (approx 500-2500μs)");

  Serial.println("\nReady to receive ESP-NOW commands...");
  Serial.println("==========================================\n");
}

void loop() {
  // Update MPU6050 readings and complementary filter
  if (mpuInitialized) {
    updateMPU();
  }

  // Send periodic telemetry to Master
  if (telemetryEnabled && hasMasterMac &&
      (millis() - lastTelemetryTime >= TELEMETRY_INTERVAL)) {
    lastTelemetryTime = millis();
    sendTelemetry();
  }

  // Non-blocking Slave LED state machine update
  updateSlaveLed();

  delay(5);
}

// Initialize ESP-NOW
void initESPNow() {
  // Set device as a Wi-Fi Station
  WiFi.mode(WIFI_STA);

  WiFi.disconnect();

  // Initialize ESP-NOW
  if (esp_now_init() != ESP_OK) {
    Serial.println("ERROR: ESP-NOW initialization failed!");
    return;
  }

  Serial.println("ESP-NOW initialized successfully");

  // Register receive callback (compatible with ESP32 Core 3.0.0+)
  esp_now_register_recv_cb(onDataRecv);
}

// Callback when data is received via ESP-NOW
#if defined(ESP_IDF_VERSION_MAJOR) && (ESP_IDF_VERSION_MAJOR >= 5)
void onDataRecv(const esp_now_recv_info *recvInfo, const uint8_t *data,
                int len) {
  const uint8_t *srcMac = recvInfo->src_addr;
#else
void onDataRecv(const uint8_t *srcMac, const uint8_t *data, int len) {
#endif
  // Record Master activity for LED timing and telemetry
  lastMasterCommandTime = millis();

  // Save master MAC address for telemetry
  if (!hasMasterMac) {
    memcpy(masterMac, srcMac, 6);
    hasMasterMac = true;
    Serial.printf("Master MAC locked: %02X:%02X:%02X:%02X:%02X:%02X\n",
                  masterMac[0], masterMac[1], masterMac[2], masterMac[3],
                  masterMac[4], masterMac[5]);
  }

  // Expect structured data packets per RNT strategy
  if (len == sizeof(cmd_struct)) {
    memcpy(&myCmd, data, sizeof(myCmd));
    String cmdStr = String(myCmd.command);

    // Only trigger fast-blink burst for explicit user commands, not 2Hz
    // background heartbeats
    if (cmdStr != "PING") {
      slaveBurstToggles = 6;
    }

    // Reconstruct string to reuse our robust processCommand logic
    if (cmdStr == "MOTOR" || cmdStr == "TORQUE" || cmdStr == "FREQ" ||
        cmdStr == "GET_CAL" || cmdStr == "TELEMETRY") {
      cmdStr += " " + String(myCmd.val1);
    } else if (cmdStr == "ANGLE" || cmdStr == "CAL_ALL") {
      cmdStr += " " + String(myCmd.val1) + " " + String(myCmd.val3, 1);
    } else if (cmdStr == "TICK") {
      cmdStr += " " + String(myCmd.val1) + " " + String(myCmd.val2);
    } else if (cmdStr == "CAL") {
      cmdStr += " " + String(myCmd.val1) + " " + String(myCmd.val2) + " " +
                String(myCmd.val3, 0);
    }

    // Debug output
    Serial.print("Received (Structured): ");
    Serial.println(cmdStr);

    // Process command
    processCommand(cmdStr, srcMac);
  }
}

// Send response back to master via ESP-NOW using struct
void sendResponse(const char *response, const uint8_t *mac_addr) {
  // Add peer if not already added
  esp_now_peer_info_t peerInfo = {};
  memcpy(peerInfo.peer_addr, mac_addr, 6);
  peerInfo.channel = 0; // Auto/default channel
  peerInfo.encrypt = false;

  // Try to add peer (will fail if already exists, which is fine)
  esp_now_add_peer(&peerInfo);

  // Pack into telemetry_struct
  memset(&myData, 0, sizeof(myData));
  strcpy(myData.type, "INFO");
  strncpy(myData.message, response, sizeof(myData.message) - 1);

  // Remove trailing newline if present since Master Serial.println adds it
  int len = strlen(myData.message);
  if (len > 0 && myData.message[len - 1] == '\n') {
    myData.message[len - 1] = '\0';
  }

  // Send structured response
  esp_now_send(mac_addr, (uint8_t *)&myData, sizeof(myData));

  // Also print to Serial for debugging
  Serial.print("Response: ");
  Serial.println(myData.message);
}

