ParagPat20/Codes/RollopodCodes/esp32_slave_pca9685/esp32_slave_pca9685.ino
// Print this device's MAC address directly from Wi-Fi hardware
void printMacAddress() {
  uint8_t baseMac[6];
  esp_err_t ret = esp_wifi_get_mac(WIFI_IF_STA, baseMac);
  if (ret == ESP_OK) {
    Serial.printf("%02X:%02X:%02X:%02X:%02X:%02X\n", baseMac[0], baseMac[1],
                  baseMac[2], baseMac[3], baseMac[4], baseMac[5]);
  } else {
    Serial.println(WiFi.macAddress());
  }
}

// ==================== Command Processing ====================

// Process received command (same logic as original Serial version)
void processCommand(String command, const uint8_t *senderMac) {
  command.toUpperCase();
  command.trim();

  char responseBuffer[256];

  // PING command: 2Hz Heartbeat ping from master
  if (command == "PING") {
    sendResponse("PONG", senderMac);
  }

  // TICK command: "TICK <channel> <value>"
  else if (command.startsWith("TICK ")) {
    int firstSpace = command.indexOf(' ');
    int secondSpace = command.indexOf(' ', firstSpace + 1);

    if (secondSpace > 0) {
      int channel = command.substring(firstSpace + 1, secondSpace).toInt();
      int tickValue = command.substring(secondSpace + 1).toInt();

      if (channel >= 0 && channel < 16 && tickValue >= 0 && tickValue <= 4095) {
        setServoPWM(channel, tickValue);
      }
    }
  }

  // ANGLE command: "ANGLE <channel> <angle>"
  else if (command.startsWith("ANGLE ")) {
    int firstSpace = command.indexOf(' ');
    int secondSpace = command.indexOf(' ', firstSpace + 1);

    if (secondSpace > 0) {
      int channel = command.substring(firstSpace + 1, secondSpace).toInt();
      float angle = command.substring(secondSpace + 1).toFloat();

      if (channel >= 0 && channel < 16 && angle >= 0.0 && angle <= 180.0) {
        setServoAngle(channel, angle);
        snprintf(responseBuffer, sizeof(responseBuffer),
                 "OK: Ch %d set to %d deg\n", channel, (int)angle);
        sendResponse(responseBuffer, senderMac);
      }
    }
  }

  // CAL command: "CAL <channel> <min_tick> <max_tick>"
  else if (command.startsWith("CAL ") && !command.startsWith("CAL_")) {
    int firstSpace = command.indexOf(' ');
    int secondSpace = command.indexOf(' ', firstSpace + 1);
    int thirdSpace = command.indexOf(' ', secondSpace + 1);

    if (thirdSpace > 0) {
      int channel = command.substring(firstSpace + 1, secondSpace).toInt();
      int minTick = command.substring(secondSpace + 1, thirdSpace).toInt();
      int maxTick = command.substring(thirdSpace + 1).toInt();

      if (channel >= 0 && channel < 16 && minTick >= 0 && maxTick > minTick &&
          maxTick <= 4095) {
        setCalibration(channel, minTick, maxTick);
        snprintf(responseBuffer, sizeof(responseBuffer),
                 "OK: Channel %d calibration set to %d-%d\n", channel, minTick,
                 maxTick);
        sendResponse(responseBuffer, senderMac);
      } else {
        sendResponse(
            "ERROR: Invalid channel or tick range (0 < min < max <= 4095)\n",
            senderMac);
      }
    } else {
      sendResponse(
          "ERROR: Invalid CAL command format. Use: CAL <channel> <min> <max>\n",
          senderMac);
    }
  }

  // CAL_ALL command: "CAL_ALL <min_tick> <max_tick>"
  else if (command.startsWith("CAL_ALL ")) {
    int firstSpace = command.indexOf(' ');
    int secondSpace = command.indexOf(' ', firstSpace + 1);

    if (secondSpace > 0) {
      int minTick = command.substring(firstSpace + 1, secondSpace).toInt();
      int maxTick = command.substring(secondSpace + 1).toInt();

      if (minTick >= 0 && maxTick > minTick && maxTick <= 4095) {
        setAllCalibrations(minTick, maxTick);
        snprintf(responseBuffer, sizeof(responseBuffer),
                 "OK: All channels calibration set to %d-%d\n", minTick,
                 maxTick);
        sendResponse(responseBuffer, senderMac);
      } else {
        sendResponse("ERROR: Invalid tick range (0 < min < max <= 4095)\n",
                     senderMac);
      }
    } else {
      sendResponse(
          "ERROR: Invalid CAL_ALL command format. Use: CAL_ALL <min> <max>\n",
          senderMac);
    }
  }

  // GET_CAL command: "GET_CAL <channel>"
  else if (command.startsWith("GET_CAL ")) {
    int channel = command.substring(8).toInt();
    if (channel >= 0 && channel < 16) {
      getCalibration(channel, senderMac);
    } else {
      sendResponse("ERROR: Invalid channel (0-15)\n", senderMac);
    }
  }

  // GET_ALL_CAL command
  else if (command == "GET_ALL_CAL") {
    getAllCalibrations(senderMac);
  }

  // FREQ command: "FREQ <frequency>"
  else if (command.startsWith("FREQ ")) {
    int freq = command.substring(5).toInt();

    if (freq >= 40 && freq <= 1000) {
      setPWMFrequency(freq);
      snprintf(responseBuffer, sizeof(responseBuffer),
               "OK: PWM frequency set to %d Hz\n", freq);
      sendResponse(responseBuffer, senderMac);
    } else {
      sendResponse("ERROR: Invalid frequency (40-1000 Hz)\n", senderMac);
    }
  }

  // SLEEP command
  else if (command == "SLEEP") {
    pca.sleep();
    sendResponse("OK: PCA9685 sleep mode enabled\n", senderMac);
  }

  // WAKE command
  else if (command == "WAKE") {
    pca.wakeup();
    sendResponse("OK: PCA9685 woken up\n", senderMac);
  }

  // RESET command
  else if (command == "RESET") {
    resetToDefaults();
    sendResponse("OK: Reset to default configuration\n", senderMac);
    printInfo(senderMac);
  }

  // MOTOR command: "MOTOR <speed>"
  else if (command.startsWith("MOTOR ")) {
    int speed = command.substring(6).toInt();
    if (speed >= -255 && speed <= 255) {
      setMotorSpeed(speed);
      snprintf(responseBuffer, sizeof(responseBuffer),
               "OK: Motor speed set to %d\n", speed);
      sendResponse(responseBuffer, senderMac);
    } else {
      sendResponse("ERROR: Speed must be between -255 and 255\n", senderMac);
    }
  }

  // TORQUE command: "TORQUE <1/0>"
  else if (command.startsWith("TORQUE ")) {
    int state = command.substring(7).toInt();
    if (state == 0 || state == 1) {
      setTorque(state);
      snprintf(responseBuffer, sizeof(responseBuffer), "OK: Torque set to %s\n",
               state ? "HIGH" : "LOW");
      sendResponse(responseBuffer, senderMac);
    } else {
      sendResponse("ERROR: Torque state must be 0 or 1\n", senderMac);
    }
  }

  // RESET_MPU command
  else if (command == "RESET_MPU") {
    gyroAngle = 0.0;
    if (mpuInitialized) {
      mpu.update();
      filteredAngle = atan2(mpu.getAccY(), mpu.getAccX()) * 180.0 / M_PI;
    } else {
      filteredAngle = 0.0;
    }
    sendResponse("OK: MPU6050 angles reset\n", senderMac);
  }

  // GET_MPU command
  else if (command == "GET_MPU") {
    if (!mpuInitialized) {
      sendResponse("ERROR: MPU6050 not initialized\n", senderMac);
    } else {
      char mpuBuffer[64];
      snprintf(mpuBuffer, sizeof(mpuBuffer), "MPU_DATA %.2f %.2f %.2f\n",
               filteredAngle, accelAngle, gyroAngle);
      sendResponse(mpuBuffer, senderMac);
    }
  }

  // TELEMETRY command: "TELEMETRY <1/0>"
  else if (command.startsWith("TELEMETRY ")) {
    int enable = command.substring(10).toInt();
    telemetryEnabled = (enable != 0);
    if (telemetryEnabled && !mpuInitialized) {
      sendResponse("WARNING: Telemetry ENABLED but MPU6050 not initialized!\n",
                   senderMac);
    } else {
      snprintf(responseBuffer, sizeof(responseBuffer), "OK: Telemetry %s\n",
               telemetryEnabled ? "ENABLED" : "DISABLED");
      sendResponse(responseBuffer, senderMac);
    }
  }

  // INFO command
  else if (command == "INFO") {
    printInfo(senderMac);
  }

  // Unknown command
  else {
    sendResponse("ERROR: Unknown command\n", senderMac);
  }
}

// ==================== Servo Control Functions ====================

// Set PWM directly using tick value (0-4095)
void setServoPWM(uint8_t channel, uint16_t tickValue) {
  if (channel >= 16 || tickValue > 4095) {
    return;
  }

