ParagPat20/Codes/RollopodCodes/esp32_slave_pca9685/esp32_slave_pca9685.ino
  // Store the current tick value
  servoConfigs[channel].currentTick = tickValue;

  // Set PWM on channel using setPWM(channel, on, off)
  // on=0 means pulse starts at beginning of cycle
  // off=tickValue means pulse ends at this tick count
  pca.setPWM(channel, 0, tickValue);
}

// Set servo angle using calibrated tick values
void setServoAngle(uint8_t channel, float angle) {
  if (channel >= 16 || angle < 0.0 || angle > 180.0) {
    return;
  }

  // Store the angle
  servoConfigs[channel].lastAngle = angle;

  // Map angle (0.0-180.0) to tick value using calibration
  uint16_t tickMin = servoConfigs[channel].tickMin;
  uint16_t tickMax = servoConfigs[channel].tickMax;

  // Linear interpolation: tick = tickMin + (angle/180.0) * (tickMax - tickMin)
  float tickFloat = tickMin + (angle / 180.0) * (tickMax - tickMin);
  uint16_t tickValue = (uint16_t)(tickFloat + 0.5); // Round to nearest integer

  // Clamp to valid range
  if (tickValue < tickMin)
    tickValue = tickMin;
  if (tickValue > tickMax)
    tickValue = tickMax;
  if (tickValue > 4095)
    tickValue = 4095;

  // Set the PWM
  setServoPWM(channel, tickValue);
}

// Set PWM frequency
void setPWMFrequency(uint16_t freq) {
  if (freq < 40 || freq > 1000) {
    return;
  }

  pwmFrequency = freq;
  pca.setPWMFreq(freq);

  // Re-apply all servo angles with new frequency
  for (int i = 0; i < 16; i++) {
    setServoAngle(i, servoConfigs[i].lastAngle);
  }
}

// Set calibration for a single channel
void setCalibration(uint8_t channel, uint16_t minTick, uint16_t maxTick) {
  if (channel >= 16 || minTick >= maxTick || maxTick > 4095) {
    return;
  }

  servoConfigs[channel].tickMin = minTick;
  servoConfigs[channel].tickMax = maxTick;

  // Re-apply the servo angle with new calibration
  setServoAngle(channel, servoConfigs[channel].lastAngle);
}

// Set calibration for all channels
void setAllCalibrations(uint16_t minTick, uint16_t maxTick) {
  if (minTick >= maxTick || maxTick > 4095) {
    return;
  }

  for (int i = 0; i < 16; i++) {
    servoConfigs[i].tickMin = minTick;
    servoConfigs[i].tickMax = maxTick;
    setServoAngle(i, servoConfigs[i].lastAngle);
  }
}

// Get calibration for a specific channel
void getCalibration(uint8_t channel, const uint8_t *senderMac) {
  if (channel >= 16) {
    return;
  }

  char buffer[128];
  snprintf(buffer, sizeof(buffer), "CAL_DATA %d %d %d\n", channel,
           servoConfigs[channel].tickMin, servoConfigs[channel].tickMax);
  sendResponse(buffer, senderMac);
}

// Get all calibrations
void getAllCalibrations(const uint8_t *senderMac) {
  sendResponse("ALL_CAL_DATA\n", senderMac);
  delay(10);

  for (int i = 0; i < 16; i++) {
    char buffer[128];
    snprintf(buffer, sizeof(buffer), "%d %d %d\n", i, servoConfigs[i].tickMin,
             servoConfigs[i].tickMax);
    sendResponse(buffer, senderMac);
    delay(10);
  }

  sendResponse("END_CAL_DATA\n", senderMac);
}

// Reset to default configuration
void resetToDefaults() {
  pwmFrequency = SERVO_FREQ_DEFAULT;
  pca.setPWMFreq(pwmFrequency);

  for (int i = 0; i < 16; i++) {
    servoConfigs[i].tickMin = TICK_MIN_DEFAULT;
    servoConfigs[i].tickMax = TICK_MAX_DEFAULT;
    servoConfigs[i].lastAngle = 90.0;
    setServoAngle(i, 90.0);
  }
}

// Print current configuration
void printInfo(const uint8_t *senderMac) {
  char buffer[256];

  sendResponse("\n========== Current Configuration ==========\n", senderMac);
  delay(10);

  snprintf(buffer, sizeof(buffer), "PWM Frequency: %d Hz\n", pwmFrequency);
  sendResponse(buffer, senderMac);
  delay(10);

  sendResponse("\nChannel Configuration:\n", senderMac);
  delay(10);

  sendResponse("Ch  | Angle  | Curr Tick | Tick Min | Tick Max\n", senderMac);
  delay(10);

  sendResponse("----|--------|-----------|----------|----------\n", senderMac);
  delay(10);

  for (int i = 0; i < 16; i++) {
    snprintf(buffer, sizeof(buffer),
             "%2d  | %6.1f | %4d      | %4d     | %4d\n", i,
             servoConfigs[i].lastAngle, servoConfigs[i].currentTick,
             servoConfigs[i].tickMin, servoConfigs[i].tickMax);
    sendResponse(buffer, senderMac);
    delay(10);
  }

  sendResponse("==========================================\n\n", senderMac);
}

// ==================== New Helper Functions ====================

// Initialize MPU6050 using tockn library
bool initMPU6050() {
  mpu.begin();
  Serial.println("Calculating gyro offsets, keep the robot still...");
  mpu.calcGyroOffsets(true);
  Serial.println("Offsets calculated!");
  return true;
}

// Read sensor events and update complementary filter (Z-axis rotation / X-Y
// plane pitch)
void updateMPU() {
  unsigned long now = millis();
  float dt = (now - lastMpuUpdate) / 1000.0;
  lastMpuUpdate = now;
  if (dt <= 0.0)
    dt = 0.001; // Avoid divide by zero

  mpu.update();

  // Calculate accelerometer pitch angle (assuming rotation is around local
  // Z-axis, meaning gravity component rotates in local X-Y plane)
  float accX = mpu.getAccX();
  float accY = mpu.getAccY();
  accelAngle = atan2(accY, accX) * 180.0 / M_PI;

  // Gyroscope rate around Z axis
  float gyroRate = mpu.getGyroZ();

  // Integrate gyro rate
  gyroAngle += gyroRate * dt;

  // Complementary filter
  filteredAngle = 0.98 * (filteredAngle + gyroRate * dt) + 0.02 * accelAngle;
}

// Drive DC Motor with PWM and Direction
void setMotorSpeed(int speed) {
  if (speed > 255)
    speed = 255;
  if (speed < -255)
    speed = -255;

  if (speed >= 0) {
    digitalWrite(MOTOR_DIR_PIN, HIGH);
    analogWrite(MOTOR_PWM_PIN, speed);
  } else {
    digitalWrite(MOTOR_DIR_PIN, LOW);
    analogWrite(MOTOR_PWM_PIN, -speed);
  }
}

// Set MOSFET Torque control state (0 or 1)
void setTorque(int state) { digitalWrite(MOSFET_PIN, state ? HIGH : LOW); }

// Send Live Telemetry to Master over ESP-NOW
void sendTelemetry() {
  if (!hasMasterMac)
    return;

  // Add peer if not already added
  esp_now_peer_info_t peerInfo = {};
  memcpy(peerInfo.peer_addr, masterMac, 6);
  peerInfo.channel = 0; // Auto/default channel
  peerInfo.encrypt = false;
  esp_now_add_peer(&peerInfo); // Fails gracefully if already added

  // Pack into telemetry_struct
  memset(&myData, 0, sizeof(myData));
  strcpy(myData.type, "MPU");
  myData.pitch = filteredAngle;

  esp_now_send(masterMac, (uint8_t *)&myData, sizeof(myData));
}
